LonelyWolf/stm32/sdio/main.c
#include <stm32f10x_gpio.h>
#include <stm32f10x_rcc.h>
#include <sdcard.h>
#include <uart.h>


int main(void)
{
	UART_Init();

	UART_SendStr("\nSTM32F103RET6 is online.\n");

	SD_Init();

	uint8_t b = 0;
	UART_SendStr("SD_CardInit: ");
	b = SD_CardInit();
	UART_SendHex8(b);
	UART_SendStr("\nCard version: ");
	UART_SendHex8(SD_CardType);

	uint8_t response = 0;
	UART_SendStr("\nCSD: ");
	response = SD_Read_CSD();
	if (response != 0x00) {
		UART_SendStr("error = ");
		UART_SendHex8(response);
	} else UART_SendBufHex((char*)&SD_CSD[0],16);
	UART_SendStr("\nCID: ");
	response = SD_Read_CID();
	if (response != 0x00) {
		UART_SendStr("error = ");
		UART_SendHex8(response);
	} else UART_SendBufHex((char*)&SD_CID[0],16);
	UART_SendStr("\nMax bus clk.: ");
	UART_SendHex32(SD_MaxBusClkFreq);
	UART_SendStr("\nDevice size: ");
	UART_SendHex32(SD_CardCapacity);

	UART_SendStr("\nMBR:\n");
	response = SD_Read_Block(0x00000000);
	if (response != 0x00) {
		UART_SendStr("error = ");
		UART_SendHex8(response);
	} else {
		UART_SendBufHexFancy((char*)&SD_sector[0],512,32,'.');
		UART_SendStr("Received CRC16 = ");
		UART_SendHex16(SD_CRC16_rcv);
		UART_SendStr(" Calculated CRC16 = ");
		UART_SendHex16(SD_CRC16_cmp);
	}
	UART_SendChar('\n');

	response = SD_Read_Block(0x200);
	if (response != 0x00) {
		UART_SendStr("error = ");
		UART_SendHex8(response);
	} else {
		UART_SendBufHexFancy((char*)&SD_sector[0],512,32,'.');
		UART_SendStr("Received CRC16 = ");
		UART_SendHex16(SD_CRC16_rcv);
		UART_SendStr(" Calculated CRC16 = ");
		UART_SendHex16(SD_CRC16_cmp);
	}
	UART_SendChar('\n');

	while(1);
}
